In [2]:
import pandas as pd
import sqlite3

df = pd.read_csv("salaries.csv")

In [3]:
conn = sqlite3.connect('salaries.db')

In [4]:
df.to_sql("salaries", conn, if_exists="replace", index=False)

151445

In [6]:
pd.read_sql("SELECT * FROM salaries LIMIT 5", conn)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,EX,FT,Head of Data,348516,USD,348516,US,0,US,M
1,2025,EX,FT,Head of Data,232344,USD,232344,US,0,US,M
2,2025,SE,FT,Data Scientist,145400,USD,145400,US,0,US,M
3,2025,SE,FT,Data Scientist,81600,USD,81600,US,0,US,M
4,2025,MI,FT,Engineer,160000,USD,160000,US,100,US,M

In [7]:
pd.read_sql("SELECT ROUND(AVG(salary_in_usd), 2) AS avg_salary FROM salaries", conn)

   avg_salary
0   157527.46

In [8]:
pd.read_sql("""
    SELECT experience_level, 
           ROUND(AVG(salary_in_usd), 2) AS avg_salary,
           COUNT(*) AS num_jobs
    FROM salaries 
    GROUP BY experience_level 
    ORDER BY avg_salary DESC
""", conn)

  experience_level  avg_salary  num_jobs
0               EX   200471.43      4163
1               SE   172657.76     87491
2               MI   142301.18     46128
3               EN    98961.74     13663